{
  "projects": [
    {
      "visible": true,
      "category": "",
      "title": "BriefMe",
      "description": "BriefMe, an AI-driven tool, transforms the way we process information by condensing complex content into digestible summaries. This project, built with React, Tailwind CSS, and Vite, and leveraging Rapid API's Article Extractor and Summarizer, demonstrates an adept application of advanced technologies and a commitment to creating user-oriented solutions. The elegant integration of these technologies signifies a profound understanding of modern software engineering principles.",
      "tags": ["React", "Tailwind CSS", "Vite", "Rapid API", "OpenAI's GPT-4"],
      "image": {
        "src": "../../images/briefme.png",
        "alt": "screenshot"
      },
      "links": [
        {
          "type": "github",
          "url": "https://github.com/joshuaramat/summarizer"
        },
        {
          "type": "external",
          "url": "https://brief-me-jr.netlify.app/"
        }
      ]
    },
    {
      "visible": true,
      "category": "",
      "title": "ClinicFlow",
      "description": "A web-based tool designed to help physical therapy staff at the Sutter Palo Alto Medical Foundation quickly and easily visualize patient appointments and manage their schedules. With its user-friendly interface, this app provides a convenient and efficient solution for staff to visualize the volume of patients scheduled in a given hour, manually input patient data, and view a bar graph of the appointment data. Using React.js for front-end and Chart.js for charting, this app is the perfect tool for physical therapy staff at the Sutter Palo Alto Medical Foundation to manage their schedules.",
      "tags": ["React", "Chart.js"],
      "image": {
        "src": "../../images/pt-chart.png",
        "alt": "PT Visualization",
        "linkTo": "https://clinic-flow.netlify.app"
      },
      "links": [
        {
          "type": "github",
          "url": "https://github.com/joshuaramat/pt-chart"
        },
        {
          "type": "external",
          "url": "https://clinic-flow.netlify.app"
        }
      ]
    }
  ],
  "button": {
    "visible": true,
    "label": "Visit on Github",
    "url": "https://github.com/joshuaramat"
  }
}
